[
    {
        "title": "Ühistranspordi infosüsteemide hooldustehnik",
        "company": "CV-Online värbamisteenused",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-05-12T07:04:20.000+00:00",
        "expirationDate": "2025-06-12T23:59:59.999+00:00",
        "description": "null",
        "id": 1369348,
        "employerId": 2999
    },
    {
        "title": "Full-stack arendaja",
        "company": "Aktors OÜ",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T19:00:01.703+00:00",
        "expirationDate": "2025-06-16T23:59:59.999+00:00",
        "description": "null",
        "id": 1372841,
        "employerId": 15453
    },
    {
        "title": "Android Developer | SEB, Tallinn",
        "company": "SEB",
        "location": 312,
        "salaryFrom": 2800,
        "salaryTo": 5050,
        "remoteWork": false,
        "publishDate": "2025-06-06T15:05:00.000+00:00",
        "expirationDate": "2025-07-07T23:59:59.999+00:00",
        "description": "null",
        "id": 1384855,
        "employerId": 3302
    },
    {
        "title": "IT-administraator",
        "company": "Riigi IT Keskus",
        "location": 312,
        "salaryFrom": 2800,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T13:05:28.892+00:00",
        "expirationDate": "2025-06-25T23:59:59.999+00:00",
        "description": "Tööandja tervisekindlustus, spordihüvitis, koolitused, tervisepäevad, ühisüritused.",
        "id": 1384763,
        "employerId": 67764
    },
    {
        "title": "Business Analyst (Finance domain)",
        "company": "AS CGI Eesti",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": true,
        "publishDate": "2025-06-06T12:55:32.486+00:00",
        "expirationDate": "2025-07-06T23:59:59.999+00:00",
        "description": "null",
        "id": 1384749,
        "employerId": 4878
    },
    {
        "title": "Infoturbe ekspert",
        "company": "EY Estonia",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T12:42:41.262+00:00",
        "expirationDate": "2025-07-06T23:59:59.999+00:00",
        "description": "null",
        "id": 1384701,
        "employerId": 2221
    },
    {
        "title": "Automation QA Engineer (Fraud and Risk)",
        "company": "Yolo Group (Heathmont OÜ)",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T12:01:07.943+00:00",
        "expirationDate": "2025-06-29T23:59:59.999+00:00",
        "description": "As a Senior Automation QA Engineer, you'll be responsible for leading the design and implementation of comprehensive test automation strategies to ensure product quality and reliability. Your day-to-day Creating a plan of test automation for our products and implementing automation according to this plan; Estimating, prioritizing, planning and coordinating testing activities; Reviewing user stories and functional requirements to create test cases; Working with the development team and customers to clearly understand the application requirements and functionality to help determine test cases and communicate issues found; Executing ready test cases and exploratory testing; Designing, developing and executing automation scripts; Identifying, recording, documenting thoroughly, and tracking bugs; Monitoring debugging process results; Performing thorough regression testing when bugs are resolved; Conducting post-release/ post-implementation testing; Developing and applying testing processes for existing products to improve quality; Guiding the development team in establishing and executing quality assurance processes and best practices; Designing and implementing automation frameworks from scratch; Mentoring and guiding junior QA engineers in automation practices and processes; Developing and implementing a comprehensive testing strategy that aligns with product goals and timelines. Your background and mindset At least 5 years of experience in QA automation; Knowledge of software QA methodologies, tools, and processes; Experience in test automation (writing automated tests, maintaining framework); Experience in writing clear, concise, and comprehensive test plans and test cases; Experience in developing automated tests using Browser Automation Libraries like Playwright, Selenium, or Cypress; Ability to work on multiple tasks simultaneously; Critical thinking and analytical skills to examine bug reports and prioritize necessary tests; Good level of knowledge of at least one programming language (preferably JavaScript/TypeScript); Good communication (English skills) and teamwork skills to interact with project team members, clients, and management. Youll work closely with the dev team from reproducing the reported issue and emphasizing the fix for critical bugs, to understanding how the bug has been fixed; Experience with Elixir is a nice to have; Previous experience in iGaming is a plus. Benefits for you Learning & Growth. Personal L&D budget, internal and external training, company-wide knowledge-sharing sessions, smooth 2-day onboarding experience through Yolo Takeoff, and plenty of career development opportunities. Slice of Yolo. A unique chance to invest in Yolo Group's venture fund, support the startups shaping our ecosystem, and grow alongside the businesses you believe in. Wellbeing. Monthly sports allowance via Stebby, 3 paid wellness days, paid sick leave from day one, private health insurance via Salu, and mental health support via Siffi - a balanced work-life approach to support both physical and mental wellbeing. Milestones & Moments. Extra paid time off your birthday, work anniversaries, marriage, childs first school day, and other personal and professional milestones. Workplace Experience. Office-first workplace experience with modern spaces, (subject to availability), top-notch equipment, and all the coffee, snacks, and drinks you need to stay fueled. We make sure you have everything to perform at your best. Legendary Events. Annual Yolo Gala, Yolo Summer Event, quarterly Meet & Mingle and regular team events - a mix of formal gatherings and spontaneous celebrations to keep the team spirit high. Please note, we don't offer a relocation support for this position! null",
        "id": 1381164,
        "employerId": 11795
    },
    {
        "title": "IT Specialist",
        "company": "Ericsson Estonia AS",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T12:01:07.927+00:00",
        "expirationDate": "2025-06-13T23:59:59.999+00:00",
        "description": "We are looking for a new colleague to join our Local IT team at Tallinn Supply Site. The team ensures stable IT support, asset management and device handling. This IT Specialist role supports service quality, digital workplace evolution and coordinates closely with the 24/7 IT team on factory production orders. IT Specialist plans, installs, operates and monitors the software and hardware solutions for the internal Ericsson users, securing a stable environment and optimizing the solutions/services to the agreed service levels in a cost efficient and timely manner. This role offers hands-on experience, collaboration with different local and global teams, and opportunities to drive improvements ideal for someone eager to grow in a dynamic tech environment. This role is a full time office based role at Peterburi tee 67a, Tallinn. What you will do • Providing technical support and training to internal customers in the area of IT devices (e.g. mobile phones, laptops, printers, desktop computers, industrial computers etc.) and business applications and performing activities for configuration and integration thereof. • Driving operational maintenance and support activities of IT devices and performing these activities for basic and complex solutions. • Troubleshooting and solving both basic and complex incidents in IT ticketing system, escalating to following levels of support. • Driving the development of basic IT solutions and participating in the development of complex IT solutions. • Ordering, registering, monitoring, decommissioning of IT devices and supplies; managing IT equipment logistics and coordinating orders with sourcing and vendors. • Contributing to continuous improvements in the organization by proposing and participating in local and global improvement initiatives and sharing of knowledge. • Act as a mentor to others. The skills you bring • Knowledge and experience across IT service portfolio. • Knowledge and skills to configure, operate and support IT devices and Windows, Android and iOS based systems. • Strong technical support and troubleshooting skills and ability to provide technical support to customers. • Knowledge and experience in hardware handling and troubleshooting. • Knowledge and experience with IT equipment logistics and coordinating orders. • English and Estonian or Russian proficiency. • Ability to create/plan cost effective solutions. • Ability to drive and implement solutions. • Communication skills, punctuality and responsibility. Nice to have: • Change and improvement management skills. • Project management skills. • Financial acumen & skills. Please note, this role is based in Tallinn and only local candidates based in Estonia will be considered for the role! null",
        "id": 1381106,
        "employerId": 68741
    },
    {
        "title": "Õigusnõunik",
        "company": "Tarbijakaitse ja Tehnilise Järelevalve Amet",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": true,
        "publishDate": "2025-06-06T11:55:45.000+00:00",
        "expirationDate": "2025-06-20T23:59:59.999+00:00",
        "description": "null",
        "id": 1384697,
        "employerId": 5290
    },
    {
        "title": "Andmestrateegia projektijuht",
        "company": "Metrosert AS",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T10:46:03.194+00:00",
        "expirationDate": "2025-07-06T23:59:59.999+00:00",
        "description": "null",
        "id": 1384632,
        "employerId": 4687
    },
    {
        "title": "Data Manager",
        "company": "Harju Elekter Group AS",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T09:00:01.210+00:00",
        "expirationDate": "2025-06-28T23:59:59.999+00:00",
        "description": "null",
        "id": 1380971,
        "employerId": 3879
    },
    {
        "title": "Andmeteadlane",
        "company": "Metrosert AS",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T08:47:21.623+00:00",
        "expirationDate": "2025-06-26T23:59:59.999+00:00",
        "description": "null",
        "id": 1384552,
        "employerId": 4687
    },
    {
        "title": "Product Owner",
        "company": "CMA CGM GLOBAL BUSINESS SERVICES OÜ",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T08:20:57.012+00:00",
        "expirationDate": "2025-07-06T23:59:59.999+00:00",
        "description": "CMA CGM Group, a world leader in shipping and logistics, is headquartered in Marseille and has a global presence across hundreds of agencies. Our Tallinn office, home to around 400 employees, plays a strategic role in the Group's success. Innovation, technology, and the dedication of our people make Global Business Services Estonia a trusted contributor to the CMA CGM Group. Were seeking a Product Owner to join our Lines & Pricing Transformation department. You'll enhance our tools to meet business objectives, deliver value to internal customers, and ensure seamless integration with other systems. Collaborating with cross-functional teams, youll play a key role in driving pricing-related processes. Responsibilities: Gather, analyze, and document business requirements. Collaborate with stakeholders to validate needs and propose solutions. Create user stories and work with UI/UX teams on mockups. Review and validate design specifications. Conduct and support functional testing to ensure quality. Maintain clear and accessible project documentation. Proven experience as a Project Manager or Business Analyst. Demonstrated involvement in projects that bridge business needs and IT solutions. Experience working in digital-focused environments, from startups to large corporations. Higher education, preferably in Product Management. Strong analytical and synthesis skills, with the ability to quickly grasp client strategies, organizational structures, business operations, and key challenges. Excellent presentation skills, with the ability to persuasively defend proposals and recommendations to secure stakeholder buy-in. Outstanding listening and communication skills, with the ability to adapt to a variety of stakeholders at all levels. Fluency in English, both written and spoken. Solid understanding of Agile frameworks (e.g., Scrum, Kanban); Product Owner (PO) certification is a plus. Strong knowledge of web and digital technologies. Awareness of design principles, user experience (UX), and ergonomics. Estonian or EU citizen or hold a long term residence permit. We offer the chance to work for one of the largest shipping and logistics companies in the world. Not only is CMA CGM GBS Estonia a multicultural working environment but we have also been awarded with the Great Place to Work certificate, received the Respecting Differences label and have been recognized for being an equal wage payer and a mental health conscious workplace. Global presence of the company opens doors for exciting career paths and learning opportunities. Among other benefits we offer health and life insurance, additional vacation days and Stebby. Extra holidays, health and life insurance, hybrid work, Stebby, career opportunities.",
        "id": 1384513,
        "employerId": 22080
    },
    {
        "title": "Site Reliability Engineer",
        "company": "Entain",
        "location": 312,
        "salaryFrom": 5000,
        "salaryTo": 6000,
        "remoteWork": false,
        "publishDate": "2025-06-06T08:00:06.745+00:00",
        "expirationDate": "2025-06-30T23:59:59.999+00:00",
        "description": "RESPONSIBILITIES: Work with development teams to implement tools and procedures for fast and reliable software delivery; Provision and manage cloud infrastructure using IaC practices. Automate everyday tasks; Implement observability solutions, use gathered data to improve system performance and reliability; Investigate incidents, troubleshoot and solve issues; Participate infrastructure specific in-house application development; Continuously work on infrastructure improvements - evaluate tools, design solutions, plan and execute migrations; Ensure infrastructure compliance with company security guidelines; REQUIREMENTS: 3 - 5 year experience in similar role; Experience in working in Linux environments; Experience in infrastructure automation using tools such as Ansible, Terraform/Terragrunt; Experience with container orchestration technologies such as Kubernetes, Docker, Helm; Experience with monitoring, alerting and logging solutions like Prometheus, Grafana, ELK; Experience with CI/CD tools like Gitlab CI, ArgoCD; Experience with managed cloud platforms - preferably GCP; Scripting experience - Python, bash; Good understanding of proper security practices in a cloud environment; Solid understanding of networking concepts such as DNS, TCP/IP, Load balancing; Drive and ability to constantly learn new things and improve the tools, systems and processes around you; Strong troubleshooting skills; Fluent English; WE OFFER: Great opportunity to take part in the development of a growth- and innovation-driven company and build its future; Dynamic work in a rapidly growing international company with personal development possibilities; Professional team with various international backgrounds to collaborate. Opportunity for career development; Wide benefits package: annual company performance bonus, extra day off on your birthday, dedicated days off for your physical and mental health, additional vacation days depending on the length of employment, health insurance policy, wellness and team-building events, dedicated budget for your training and development, paid online consultations with certified therapists and so much more! null",
        "id": 1380938,
        "employerId": 22575
    },
    {
        "title": "Golang Engineer",
        "company": "Entain",
        "location": 312,
        "salaryFrom": 4500,
        "salaryTo": 5500,
        "remoteWork": false,
        "publishDate": "2025-06-06T08:00:06.743+00:00",
        "expirationDate": "2025-06-30T23:59:59.999+00:00",
        "description": "What you will do: Build scalable, highly-available, robust systems and ensure their continuous delivery. Work on the gambling platform. Work as part of a cluster and within a cross-functional team. Take part in whole feature development processes - from the inception of ideas to deployment and maintenance. Prepare a development plan, defend it, code it, ship it, own it. Examples of projects our teams have worked on: MGA compliance requirements: reality check control, player limits, self-exclusions. State of the art incentive system that allows prolonged gaming experience to our players. New integrations with various game providers, sports betting, casino games, bingo, etc. Sophisticated new promotional campaign mechanics for players. We are looking for someone who: Has 5+ years of experience in development out of which 3+ with Golang Can demonstrate deep understanding of Golang development culture. Has experience with transactional databases and messaging systems. At least some experience with Docker. Feels very comfortable in a Linux environment and working with Git tooling. Practices test-driven development. Is able to cooperate with colleagues and understand the value of each developer in team performance. Ready to work with the existing codebase, update and improve it. We offer: Great opportunity to take part in the development of growth- and innovation-driven company and build its future. Dynamic work in a rapidly growing international company with personal development possibilities. Professional team with various, international backgrounds to collaborate. Opportunity for career development. Wide benefits package: annual company performance bonus, an extra day off on your birthday, dedicated days off for your physical and mental health, additional vacation days depending on the length of employment, health insurance policy, wellness and team-building events, dedicated budget for your training and development, paid online consultations with certified therapists and so much more! null",
        "id": 1380937,
        "employerId": 22575
    },
    {
        "title": "Full Stack Developer -TypeScript/NestJS (Backend Focus)",
        "company": "Entain",
        "location": 312,
        "salaryFrom": 4000,
        "salaryTo": 5000,
        "remoteWork": false,
        "publishDate": "2025-06-06T08:00:06.742+00:00",
        "expirationDate": "2025-06-30T23:59:59.999+00:00",
        "description": "We're seeking a skilled Full Stack Developer with a strong focus on backend development to join our team. You'll be working on a TypeScript/NestJS application with Angular on the frontend. Your primary responsibilities will be developing, maintaining, and optimizing our server-side services, while also contributing to the frontend as needed. REQUIRED SKILLS: Strong experience with TypeScript Proven experience with Node.js and NestJS framework Understanding of RESTful API design principles Experience with database operations and ORM frameworks Good knowledge of PostgreSQL Familiarity with dependency injection and service-oriented architecture Proficiency in writing unit tests using Jest or similar testing frameworks Experience with Angular framework QUALIFICATIONS 5+ years of experience in full stack development Strong problem-solving abilities Experience with Git version control Good communication skills and ability to work in a team WE OFFER: Great opportunity to take part in the development of growth- and innovation-driven company and build its future Dynamic work in a rapidly growing international company with personal development possibilities. Professional team with various, international backgrounds to collaborate. Opportunity for career development. Competitive salary and benefits package: annual company performance bonus, extra day off on your birthday, dedicated days off for your physical and mental health, additional vacation days depending on the length of employment, health insurance policy, wellness and team-building events, dedicated budget for your training and development, paid online consultations with certified therapists and so much more! null",
        "id": 1380936,
        "employerId": 22575
    },
    {
        "title": "Senior DevOps Engineer",
        "company": "Entain",
        "location": 312,
        "salaryFrom": 4500,
        "salaryTo": 6000,
        "remoteWork": false,
        "publishDate": "2025-06-06T08:00:06.740+00:00",
        "expirationDate": "2025-06-30T23:59:59.999+00:00",
        "description": "Job responsibilities: Work with development teams to implement tools and procedures for fast and reliable software delivery; Provision and manage cloud infrastructure using IaC practices. Automate everyday tasks; Analyze and use gathered observability data to improve system performance and reliability; Investigate incidents, troubleshoot and solve issues; Participate infrastructure specific in-house application development; Work on infrastructure improvements - evaluate tools, design solutions, plan and execute migrations; Assist with database and data infrastructure operations; Ensure infrastructure compliance with company security guidelines. Our expectations: 5+ year experience in similar role; Experience in working in Linux environments; Experience in infrastructure automation using tools such as Ansible, Terraform/Terragrunt; Experience with container orchestration technologies such as Kubernetes, Docker, Helm; Experience with monitoring, alerting and logging solutions like Prometheus, Loki, Grafana, Kibana; Experience with CI/CD tools - Jenkins, Gitlab CI, ArgoCD; Experience with managed cloud platforms - GCP; Scripting experience - Python, bash; Experience with supporting relational database operations - PostgreSQL, Clickhouse; Experience with supporting noSQL database operations - MongoDB, Redis; Experience with supporting event streaming platforms - RabbitMQ, Kafka; Good understanding of proper security practices in a cloud environment; Solid understanding of networking concepts such as DNS, TCP/IP, Load balancing; Drive and ability to constantly learn new things and improve the tools, systems and processes around you; Strong troubleshooting skills; Fluent English. We offer: Great opportunity to take part in the development of a growth- and innovation-driven company and build its future. Dynamic work in a rapidly growing international company with personal development possibilities. Professional team with various international backgrounds to collaborate. Opportunity for career development. Wide benefits package: annual company performance bonus, extra day off on your birthday, dedicated days off for your physical and mental health, additional vacation days depending on the length of employment, health insurance policy, wellness and team-building events, dedicated budget for your training and development, paid online consultations with certified therapists and so much more! null",
        "id": 1380935,
        "employerId": 22575
    },
    {
        "title": "IT-spetsialist",
        "company": "Metrosert AS",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T08:00:06.695+00:00",
        "expirationDate": "2025-06-22T23:59:59.999+00:00",
        "description": "null",
        "id": 1376376,
        "employerId": 4687
    },
    {
        "title": "Arendaja (viisa tiim)",
        "company": "Siseministeeriumi infotehnoloogia- ja arenduskeskus",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": true,
        "publishDate": "2025-06-06T06:39:55.117+00:00",
        "expirationDate": "2025-06-25T23:59:59.999+00:00",
        "description": "null",
        "id": 1384406,
        "employerId": 379
    },
    {
        "title": "TechOps Support for Hub88",
        "company": "Yolo Group (Heathmont OÜ)",
        "location": 312,
        "salaryFrom": null,
        "salaryTo": null,
        "remoteWork": false,
        "publishDate": "2025-06-06T06:00:40.794+00:00",
        "expirationDate": "2025-06-15T23:59:59.999+00:00",
        "description": "Our Hub88 TechOps team is growing, and we are looking for new talent to join us on our journey! We're looking for a detail-oriented team player with strong communication skills and a passion for problem-solving. The ideal candidate thrives in a fast-paced environment, is comfortable working with both internal teams and external clients, and brings a customer-first mindset to everything they do. Due to the nature of this position you will participate in various different aspects of business to business workflows from compliance, sales, accounting, account management, product development and customer support - TechOps supports and is supported by all the aforementioned departments. Your day-to-day Coordinating, configuring, onboarding and supporting internal and external clients integrated to our platforms; Cooperating with other TechOps teams, Supplier operations team, the Product development teams, Commercial team and Management; Responding to and resolving external and internal queries and incidents in a timely manner including on-call support out of business hours on a rotating roster; Investigating, logging and resolving identified issues and performing routine follow ups of escalated issues until resolution; Reporting and escalate any potential fraud or security issues. Your background and mindset 1-3 years of experience as technical support, application engineer or similar technical position; Pragmatic approach to problem solving; Attention to detail and precision; Excellent level of verbal and written English; A team player and strong communicator, with excellent interpersonal skills; Be proactive, adaptive and possess a customer-focused mindset; Understanding of gambling game fundamentals; Exceptional verbal and written communication skills in English; Confidence with Excel/Google Sheets is a plus; Experience in igaming is a plus. Benefits for you Learning & Growth. Personal L&D budget, internal and external training, company-wide knowledge-sharing sessions, smooth 2-day onboarding experience through Yolo Takeoff, and plenty of career development opportunities. Slice of Yolo. A unique chance to invest in Yolo Group's venture fund, support the startups shaping our ecosystem, and grow alongside the businesses you believe in. Wellbeing. Monthly sports allowance via Stebby, 3 paid wellness days, paid sick leave from day one, private health insurance via Salu, and mental health support via Siffi - a balanced work-life approach to support both physical and mental wellbeing. Milestones & Moments. Extra paid time off your birthday, work anniversaries, marriage, childs first school day, and other personal and professional milestones. Workplace Experience. Office-first workplace experience with modern spaces, (subject to availability), top-notch equipment, and all the coffee, snacks, and drinks you need to stay fueled. We make sure you have everything to perform at your best. Legendary Events. Annual Yolo Gala, Yolo Summer Event, quarterly Meet & Mingle and regular team events - a mix of formal gatherings and spontaneous celebrations to keep the team spirit high. Please note, we don't offer a relocation support for this position! null",
        "id": 1372654,
        "employerId": 11795
    }
]